espressif/openocd-esp32/contrib/loaders/flash/espressif/stub_flasher.c
	stub_flash_cache_flush();

#if STUB_LOG_ENABLE == 1
	if (stub_get_log_level() >= STUB_LOG_LEVEL_DEBUG) {
		uint8_t tmp[8];
		rc = stub_flash_read_buff(bp_flash_addr & ~0x3UL, (uint32_t *)tmp, sizeof(tmp));
		if (rc != ESP_ROM_SPIFLASH_RESULT_OK) {
			STUB_LOGE("Failed to read insn (%d)!\n", rc);
			return ESP_STUB_ERR_FAIL;
		}
		STUB_LOGD("%s: WROTE 0x%x 0x%x [%02x %02x %02x %02x %02x %02x %02x %02x]\n",
			__func__,
			bp_flash_addr,
			insn_buf_addr,
			tmp[0],
			tmp[1],
			tmp[2],
			tmp[3],
			tmp[4],
			tmp[5],
			tmp[6],
			tmp[7]);
	}
#endif
	return insn_sz;
}

/*
 * This function combines multiple flash addresses and instructions into a single buffer.
 * The following variables are used:
 * bp_flash_addr --> bp0_flash_addr + bp1_flash_addr + bp2_flash_addr + ... + bpn_flash_addr
 * insn_buf_addr <-- insn_sz0 + inst0 + insn_sz1 + inst1 + insn_sz2 + inst2 + ... + insn_szn + instn
 *
 * Each bp_flash_addr is 4 bytes long.
 * Each insn_sz is 1 byte long, representing the size of the corresponding instruction. (2 or 3)
 * Each inst is 3 bytes long.
 *
 */
static __maybe_unused uint8_t stub_flash_set_bp_multi(uint32_t *bp_flash_addr,
	uint8_t *insn_buf_addr, uint8_t *insn_sect, uint32_t num_bps)
{
	STUB_LOGD("%s %d bps\n", __func__, num_bps);

	struct esp_flash_stub_bp_instructions *bp_insts = (struct esp_flash_stub_bp_instructions *)insn_buf_addr;
	for (size_t i = 0; i < num_bps; ++i) {
		uint8_t rc = stub_flash_set_bp(bp_flash_addr[i], (uint32_t)&bp_insts[i].buff, insn_sect);
		if (rc == 0)
			return rc;
		bp_insts[i].size = rc;
	}

	return num_bps * sizeof(struct esp_flash_stub_bp_instructions);
}

static __maybe_unused int stub_flash_clear_bp(uint32_t bp_flash_addr,
	uint32_t insn_buf_addr, uint8_t *insn_sect)
{
	esp_rom_spiflash_result_t rc;
	uint8_t *insn = (uint8_t *)insn_buf_addr;
	uint8_t insn_sz = stub_get_insn_size(insn);
	const size_t inst_buff_size = stub_get_inst_buff_size(bp_flash_addr, insn_sz);

	STUB_LOGD("%s: 0x%x 0x%x [%02x %02x %02x %02x]\n",
		__func__,
		bp_flash_addr,
		insn_buf_addr,
		insn[0],
		insn[1],
		insn[2],
		insn[3]);

	stub_flash_cache_flush();

	rc = stub_flash_read_buff(ALIGN_DOWN(bp_flash_addr, STUB_FLASH_SECTOR_SIZE),
		(uint32_t *)insn_sect,
		inst_buff_size);
	if (rc != ESP_ROM_SPIFLASH_RESULT_OK) {
		STUB_LOGE("Failed to read insn sector (%d)!\n", rc);
		return ESP_STUB_ERR_FAIL;
	}

	/* this will erase full sector or two */
	if (stub_flash_erase(bp_flash_addr, inst_buff_size) != ESP_STUB_ERR_OK) {
		STUB_LOGE("Failed to erase insn sector!\n");
		return ESP_STUB_ERR_FAIL;
	}
	insn_sect[(bp_flash_addr & (STUB_FLASH_SECTOR_SIZE - 1)) + 0] = insn[0];
	insn_sect[(bp_flash_addr & (STUB_FLASH_SECTOR_SIZE - 1)) + 1] = insn[1];
	if (insn_sz > 2)
		insn_sect[(bp_flash_addr & (STUB_FLASH_SECTOR_SIZE - 1)) + 2] = insn[2];
	if (insn_sz > 3)
		insn_sect[(bp_flash_addr & (STUB_FLASH_SECTOR_SIZE - 1)) + 3] = insn[3];
	rc = stub_spiflash_write(bp_flash_addr & ~(STUB_FLASH_SECTOR_SIZE - 1),
		(uint32_t *)insn_sect,
		inst_buff_size,
		stub_get_flash_encryption_mode() != ESP_FLASH_ENC_MODE_DISABLED);
	if (rc != ESP_ROM_SPIFLASH_RESULT_OK) {
		STUB_LOGE("Failed to restore insn (%d)!\n", rc);
		return ESP_STUB_ERR_FAIL;
	}

	stub_flash_cache_flush();

#if STUB_LOG_ENABLE == 1
	if (stub_get_log_level() >= STUB_LOG_LEVEL_DEBUG) {
		uint8_t tmp[8];
		rc = stub_flash_read_buff(bp_flash_addr & ~0x3UL, (uint32_t *)tmp, sizeof(tmp));
		if (rc != ESP_ROM_SPIFLASH_RESULT_OK) {
			STUB_LOGE("Failed to read insn (%d)!\n", rc);
			return ESP_STUB_ERR_FAIL;
		}
		STUB_LOGD("%s: WROTE 0x%x 0x%x [%02x %02x %02x %02x %02x %02x %02x %02x]\n",
			__func__,
			bp_flash_addr,
			insn_buf_addr,
			tmp[0],
			tmp[1],
			tmp[2],
			tmp[3],
			tmp[4],
			tmp[5],
			tmp[6],
			tmp[7]);
	}
#endif
	return ESP_STUB_ERR_OK;
}

static __maybe_unused uint8_t stub_flash_clear_bp_multi(uint32_t *bp_flash_addr,
	uint8_t *insn_buf_addr, uint8_t *insn_sect, uint32_t num_bps)
{
	STUB_LOGD("%s %d bps\n", __func__, num_bps);

	struct esp_flash_stub_bp_instructions *bp_insts = (struct esp_flash_stub_bp_instructions *)insn_buf_addr;

	for (size_t i = 0; i < num_bps; ++i) {
		int rc = stub_flash_clear_bp(bp_flash_addr[i], (uint32_t)&bp_insts[i].buff, insn_sect);
		if (rc < 0)
			return rc;
	}

	return ESP_STUB_ERR_OK;
}

static int stub_flash_handler(int cmd, va_list ap)
{
	int ret = ESP_STUB_ERR_OK;
	struct stub_flash_state flash_state;
	uint32_t arg1 __maybe_unused = va_arg(ap, uint32_t);  /* flash_addr, start_sect */
	uint32_t arg2 __maybe_unused = va_arg(ap, uint32_t);	/* number of sectors */
	uint8_t *arg3 __maybe_unused = va_arg(ap, uint8_t *);	/* sectors' state buf address */
	uint32_t arg4 __maybe_unused = va_arg(ap, uint32_t);	/* set/clear bp count */

	STUB_LOGD("%s arg1 %x, arg2 %d\n", __func__, arg1, arg2);

	stub_flash_state_prepare(&flash_state);

	uint32_t flash_size = stub_flash_get_size();
	if (flash_size == 0) {
		STUB_LOGE("Failed to get flash size!\n");
		if (cmd != ESP_STUB_CMD_FLASH_MAP_GET) {
			ret = ESP_STUB_ERR_FAIL;
			goto _flash_end;
		}
		/* We will fill the esp_stub_flash_map struct and set the return code there */
	} else {
		esp_rom_spiflash_config_param(g_rom_flashchip.device_id,
			flash_size,
			STUB_FLASH_BLOCK_SIZE,
			STUB_FLASH_SECTOR_SIZE,
			STUB_FLASH_PAGE_SIZE,
			STUB_FLASH_STATUS_MASK);

		esp_rom_spiflash_result_t rc = esp_rom_spiflash_unlock();
		if (rc != ESP_ROM_SPIFLASH_RESULT_OK) {
			STUB_LOGE("Failed to unlock flash (%d)\n", rc);
			ret = ESP_STUB_ERR_FAIL;
			goto _flash_end;
		}
	}

	switch (cmd) {
#ifdef CMD_FLASH_READ
	case ESP_STUB_CMD_FLASH_READ:
		ret = stub_flash_read(arg1, arg2);
		break;
#endif
#ifdef CMD_FLASH_ERASE
	case ESP_STUB_CMD_FLASH_ERASE:
		ret = stub_flash_erase(arg1, arg2);
		break;
#endif
#ifdef CMD_FLASH_ERASE_CHECK
	case ESP_STUB_CMD_FLASH_ERASE_CHECK:
		ret = stub_flash_erase_check(arg1, arg2, arg3);
		break;
#endif
#ifdef CMD_FLASH_WRITE
	case ESP_STUB_CMD_FLASH_WRITE:
		ret = stub_flash_write((void *)arg1);
		break;
#endif
#ifdef CMD_FLASH_WRITE_DEFLATED
	case ESP_STUB_CMD_FLASH_WRITE_DEFLATED:
		ret = stub_flash_write_deflated((void *)arg1);
		break;
#endif
#ifdef CMD_FLASH_CALC_HASH
	case ESP_STUB_CMD_FLASH_CALC_HASH:
		ret = stub_flash_calc_hash(arg1, arg2, arg3);
		break;
#endif
#if defined(CMD_FLASH_MAP_GET) || defined(CMD_FLASH_MULTI_COMMAND) || defined(CMD_FLASH_IDF_BINARY)
	case ESP_STUB_CMD_FLASH_MAP_GET:
		ret = stub_flash_get_map(arg1, arg2, flash_size);
		break;
#endif
#if defined(CMD_FLASH_BP_SET) || defined(CMD_FLASH_MULTI_COMMAND) || defined(CMD_FLASH_IDF_BINARY)
	case ESP_STUB_CMD_FLASH_BP_SET:
		ret = stub_flash_set_bp_multi((void *)arg1, (void *)arg2, (void *)arg3, arg4);
		break;
#endif
#if defined(CMD_FLASH_BP_CLEAR) || defined(CMD_FLASH_MULTI_COMMAND) || defined(CMD_FLASH_IDF_BINARY)
	case ESP_STUB_CMD_FLASH_BP_CLEAR:
		ret = stub_flash_clear_bp_multi((void *)arg1, (void *)arg2, (void *)arg3, arg4);
		break;
#endif
#ifdef CMD_FLASH_CLOCK_CONFIGURE
	case ESP_STUB_CMD_FLASH_CLOCK_CONFIGURE:
		ret = stub_cpu_clock_configure(arg1);
		if (stub_get_log_dest() == STUB_LOG_DEST_UART)
			stub_uart_console_configure(stub_get_log_dest());
		break;
#endif
#ifdef CMD_FLASH_TEST
	case ESP_STUB_CMD_FLASH_TEST:
		ret = stub_flash_test();
		break;
#endif
	default:
		ret = ESP_STUB_ERR_NOT_SUPPORTED;
	}

_flash_end:
	stub_flash_state_restore(&flash_state);
	return ret;
}

uint32_t stub_esp_clk_cpu_freq(void)
{
	extern uint32_t g_stub_cpu_freq_hz;
	return g_stub_cpu_freq_hz;
}

void ets_update_cpu_frequency(uint32_t ticks_per_us)
{
	/* do nothing for stub */
}

__attribute__((weak)) int stub_cpu_clock_configure(int cpu_freq_mhz)
{
	return 0;
}

