espressif/openocd-esp32/contrib/loaders/flash/espressif/stub_flasher.c
__attribute__((weak)) void stub_uart_console_configure(int dest)
{
}

__attribute__((weak)) esp_flash_enc_mode_t stub_get_flash_encryption_mode(void)
{
	return ESP_FLASH_ENC_MODE_DISABLED;
}

__attribute__((weak)) void stub_log_init(enum stub_log_levels level, enum stub_log_destination dest)
{
}

#if STUB_LOG_ENABLE == 1
const char *cmd_to_str(int cmd)
{
	switch (cmd) {
	case ESP_STUB_CMD_FLASH_READ: return "FLASH_READ";
	case ESP_STUB_CMD_FLASH_WRITE: return "FLASH_WRITE";
	case ESP_STUB_CMD_FLASH_ERASE: return "FLASH_ERASE";
	case ESP_STUB_CMD_FLASH_ERASE_CHECK: return "FLASH_ERASE_CHECK";
	case ESP_STUB_CMD_FLASH_MAP_GET: return "FLASH_MAP_GET";
	case ESP_STUB_CMD_FLASH_BP_SET: return "FLASH_BP_SET";
	case ESP_STUB_CMD_FLASH_BP_CLEAR: return "FLASH_BP_CLEAR";
	case ESP_STUB_CMD_FLASH_TEST: return "FLASH_TEST";
	case ESP_STUB_CMD_FLASH_WRITE_DEFLATED: return "FLASH_WRITE_DEFLATED";
	case ESP_STUB_CMD_FLASH_CALC_HASH: return "FLASH_CALC_HASH";
	case ESP_STUB_CMD_FLASH_CLOCK_CONFIGURE: return "CLOCK_CONFIGURE";
	default: return "";
	}
}
#endif

int stub_main(int cmd, ...)
{
	va_list ap;
	int ret = 0;

	/* zero bss */
	for (uint32_t *p = &_bss_start; p < &_bss_end; p++)
		*p = 0;

	/* we get here just after OpenOCD's stub trampoline
	 * up to 5 parameters are passed via registers by that jumping code */
	/* interrupts level in PS is set to 5 to allow high prio IRQs only (including Debug Interrupt) */
	/* We need Debug Interrupt Level to allow breakpoints handling by OpenOCD */
	stub_log_init(STUB_RESET_LOG_LEVEL, STUB_RESET_LOG_DEST);
	STUB_LOGD("cpu_freq:%d Mhz\n", stub_esp_clk_cpu_freq() / MHZ);
	STUB_LOGD("DATA 0x%x..0x%x\n", &_data_start, &_data_end);
	STUB_LOGD("BSS 0x%x..0x%x\n", &_bss_start, &_bss_end);
	STUB_LOGD("cmd %d:%s\n", cmd, cmd_to_str(cmd));

	va_start(ap, cmd);
	if (cmd <= ESP_STUB_CMD_FLASH_MAX_ID) {
		ret = stub_flash_handler(cmd, ap);
	} else {
		switch (cmd) {
#if STUB_DEBUG
		case ESP_STUB_CMD_TEST:
			STUB_LOGD("TEST %d\n", cmd);
			break;
#endif
		default:
			ret = ESP_STUB_ERR_NOT_SUPPORTED;
		}
	}
	va_end(ap);

	STUB_LOGD("exit %d\n", ret);
	return ret;
}
